In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [12]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, datetime.datetime(2018, 11, 13, 0, 40, 37, 796000), 66, 'free', None, None, 514, 'Harrisburg-Carlisle, PA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.125 Safari/537.36"'),
 (3, datetime.datetime(2018, 11, 13, 1, 12, 29, 796000), 51, 'free', None, None, 510, 'Houston-The Woodlands-Sugar Land, TX', '"Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (4, datetime.datetime(2018, 11, 13, 3, 19, 2, 796000), 9, 'free', None, None, 379, 'Eureka-Arcata-Fortuna, CA', 'Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; rv:11.0) like Gecko'),
 (5, datetime.datetime(2018, 11, 13, 3, 51, 52, 796000), 49, 'free', None, None, 506, 'San Francisco-Oakland-Hayward, CA', 'Mozilla/5.0 (Windows NT 5.1; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (8, datetime.datetime(2018, 11, 13, 5, 0, 6, 796000), 94, 'free', None, None, 492, 'Ogden-Clearfield, UT', 'Mozilla/5.0 (Windows NT 6.1; WOW64; rv:32.0) Gecko/20100101 Firefox/32.0')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(51, 'Maia', 'Burke', 'F', 'free'),
 (94, 'Noah', 'Chavez', 'M', 'free'),
 (80, 'Tegan', 'Levine', 'F', 'paid'),
 (60, 'Devin', 'Larson', 'M', 'free'),
 (97, 'Kate', 'Harrell', 'F', 'paid')]

In [9]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('SOFSOCN12A8C143F5D', 'Face the Ashes', 'ARXR32B1187FB57099', 2007, 209.606)]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('ARXR32B1187FB57099', 'Gob', '', nan, nan)]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 13, 0, 40, 37, 796000), 0, 13, 46, 11, 2018, 1),
 (datetime.datetime(2018, 11, 13, 1, 12, 29, 796000), 1, 13, 46, 11, 2018, 1),
 (datetime.datetime(2018, 11, 13, 3, 19, 2, 796000), 3, 13, 46, 11, 2018, 1),
 (datetime.datetime(2018, 11, 13, 3, 51, 52, 796000), 3, 13, 46, 11, 2018, 1),
 (datetime.datetime(2018, 11, 13, 5, 0, 6, 796000), 5, 13, 46, 11, 2018, 1)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).

In [19]:
import os
import glob
import psycopg2
import pandas as pd
import numpy as np
from sql_queries import *


def process_song_file(cur, filepath): 
     
    #Insert  filepath: songs data file path.
    
    Returns:
        None
    # open song file
    df = pd.read_json(filepath, lines=True)                    

    # insert song record
    song_data = df[['song_id', 'title', 'artist_id', 'year', 'duration']].values.tolist()[0]
    cur.execute(song_table_insert, song_data)

    # insert artist record
    artist_data = df[['artist_id', 'artist_name', 'artist_location', 'artist_latitude', 'artist_longitude']].values.tolist()[0]
    cur.execute(artist_table_insert, artist_data)

def insert_time_data(cur, df):
    
    Insert all the data in the time table
    
    Params:
        cur: cursor object
        df: The dataframe to be used to create the data for the time table
        
    Returns:
        None

    # convert timestamp column to datetime
    t = pd.to_datetime(df['ts'], unit= 'ms')

    # insert time data records
    time_data = [t.values, t.dt.hour, t.dt.day, t.dt.week, t.dt.month, t.dt.year, t.dt.weekday]
    column_labels = ['TimeStamp', 'Hour', 'Day', 'Week', 'Month', 'Year', 'Weekday']
    time_df = pd.DataFrame({lab: data for lab,data in zip(column_labels, time_data)})

    for i, row in time_df.iterrows():
        cur.execute(time_table_insert, list(row))

def insert_user_data(cur, df):
    
    Insert all the data in the "users" table
    
    Params:
        cur: cursor object
        df: The dataframe to be used to create the data for the "users" table
        
    Returns:
        None
        
    # load user table
    user_df = df[['userId', 'firstName', 'lastName', 'gender', 'level']]

    # insert user records
    for i, row in user_df.iterrows():
        cur.execute(user_table_insert, row)

def insert_songplays_data(cur, df):
    Insert all the data in the "songplays" table
    
    Params:
        cur: cursor object
        df: The dataframe to be used to create the data for the "songplays" table
        
    Returns:
        None
    # insert songplay records
    for index, row in df.iterrows():

        # get songid and artistid from song and artist tables
        #print(song_select, (row.song, row.artist))
        cur.execute(song_select, (row.song, row.artist))
        results = cur.fetchone()

        if results:
            songid, artistid = results
        else:
            songid, artistid = None, None

        # insert songplay record
        songplay_data = [pd.to_datetime(row.ts, unit='ms'), row.userId, row.level, songid, artistid, row.sessionId, row.location, row.userAgent]
        cur.execute(songplay_table_insert, songplay_data)

def process_log_file(cur, filepath):
    Description: 
        This function can be used to read the file in the filepath (data/log_data)
        to get the user and time info and used to populate the users and time dim tables.
                 
    The required variables for the users table and time dim tables are
    Users Table: Unique user id (user_id), first name of the user (first_name), last name (last_name), gender (gender)
                 and subscrption level (level)
                 
    Time dimenension table: time('TimeStamp', 'Hour', 'Day', 'Week', 'Month', 'Year', 'Weekday')
    
    NOT SURE WHICH ONE is BETTER
    Arguments:
        cur: the cursor object. 
        filepath: log data file path. 
    Returns:
        None
    # open log file
    df = pd.read_json(filepath, lines=True)

    # filter by NextSong action
    df = df[df['page'] == 'NextSong']


    # Call the insert_time_data function to insert the data into the "time" table
    insert_time_data(cur, df)

    # Call the insert_user_data function to insert the data into the "users" table
    insert_user_data(cur, df)

    # Call the insert_songplay_data function to insert the data into the "songplays" table
    insert_user_data(cur, df)


def process_data(cur, conn, filepath, func):
    Description:
    This function processes all the files given in the file paths by creating a list of file paths to be 
    processed and then looping over each file and processing them using the function provided which would 
    be either 'process_song_file' function or 'process_log_file' function 
    
    Params:
        cur: the cursor object
        conn: connection to the database
        filepath: the overall directory to get the data from
        func: the function to use for processing data
        
    Returns
        None
    # get all files matching extension from directory
    all_files = []
    for root, dirs, files in os.walk(filepath):
        files = glob.glob(os.path.join(root,'*.json'))
        for f in files :
            all_files.append(os.path.abspath(f))

    # get total number of files found
    num_files = len(all_files)
    print('{} files found in {}'.format(num_files, filepath))

    # iterate over files and process
    for i, datafile in enumerate(all_files, 1):
        func(cur, datafile)
        conn.commit()
        print('{}/{} files processed.'.format(i, num_files))


def main():
    
    Params:
        None
        
    Returns:
        None

    conn = psycopg2.connect("host=127.0.0.1 dbname=sparkifydb user=student password=student")
    cur = conn.cursor()

    process_data(cur, conn, filepath='data/song_data', func=process_song_file)
    process_data(cur, conn, filepath='data/log_data', func=process_log_file)

    conn.close()


if __name__ == "__main__":
    main()

SyntaxError: invalid syntax (<ipython-input-19-220280b6e9f7>, line 12)